Repository: AshCraler/ipa-handbook
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Hello World!
vi: Xin chào thế giới!

source: Setting
vi: Cài đặt

# pronounce_instruction
source: To make the /{sound}/ sound:
vi: Để tạo âm /{sound}/:

source: In Words
vi: Trong từ vựng

# in_word_subtitle
source: The /{sound}/ sound plays an important role in the difference between the paired words below.
vi: Âm /{sound}/ đóng vai trò quan trọng trong sự khác biệt giữa các từ ghép dưới đây.

# pair_title
source: Listen to each pair, paying attention to how the first word differs from the second.
vi: Nghe từng cặp từ, chú ý vào cách từ đầu tiên khác với từ thứ hai.

# in_word_long_record_advice
source: Record yourself repeating the words, making sure to focus on the pronunciation of /{sound}/. Then, compare it to the model recording. If you need help, check out the animated video to see exactly how to pronounce the /{sound}/ sound.
vi: Ghi âm lại bản thân đang lặp lại các từ, chắc chắn tập trung vào cách phát âm của âm /{sound}/. Sau đó, so sánh với bản ghi mẫu. Nếu bạn cần giúp đỡ, xem video hoạt hình để thấy cách phát âm chính xác âm /{sound}/.

# in_word_short_record_advice
source: Record yourself repeating the words, making sure to focus on the pronunciation of /{sound}/. Then, compare it to the model recording.
vi: Ghi âm lại bản thân đang lặp lại các từ, chắc chắn tập trung vào cách phát âm của âm /{sound}/. Sau đó, so sánh với bản ghi mẫu.

# in_word_long_repeat_advice
source: Repeat this exercise several times a day. As with any skill, improving takes repetition and practice.
vi: Lặp lại bài tập này mỗi ngày nhiều lần. Như bất kỳ kỹ năng nào khác, việc cải thiện đòi hỏi sự lặp đi lặp lại và thực hành.

# in_word_short_repeat_advice
source: Repeat this exercise several times a day.
vi: Lặp lại bài tập này mỗi ngày nhiều lần.

# position_example_subtitle
source: Here are several common words that include /{sound}/. It's a good idea to be comfortable with their pronunciation.
vi: Dưới đây là một số từ thông dụng bao gồm âm /{sound}/. Nên làm quen với cách phát âm của chúng.

# in_word_listen_advice
source: Listen to how each word is pronounced, focusing on /{sound}/. Notice how /{sound}/ can appear at the beginning, middle, or end of a word.
vi: Nghe cách phát âm của từng từ, tập trung vào âm /{sound}/. Chú ý rằng âm /{sound}/ có thể xuất hiện ở đầu, giữa hoặc cuối của một từ.

source: In Sentences
vi: Trong câu

# in_sentence_subtitle
source: It's important to go beyond single words when you practice sounds in English. Tongue twisters (difficult-to-pronounce sentences) are a great way to train your tongue to pronounce /k/ in a stream of speech.
vi: Việc này quan trọng hơn là việc chỉ tập trung vào các từ đơn khi bạn luyện tập âm trong tiếng Anh. Các câu vận động lưỡi (các câu khó phát âm) là một cách tuyệt vời để rèn luyện lưỡi để phát âm /{sound}/ trong một câu lưu loát.

# sentence_title
source: Listen to how each tongue twister is pronounced. Be sure to note the sounds or words that might be challenging for you, and how many times you will pronounce /{sound}/.
vi: Nghe cách phát âm mỗi câu vận động lưỡi. Hãy chú ý các âm hoặc từ có thể khó khăn đối với bạn và số lần bạn sẽ phát âm /{sound}/.

# in_sentence_long_record_advice
source: Record yourself repeating the tongue twister. Try it slowly first, and then gradually increase to a fluid, natural-feeling pace.
vi: Ghi âm lại khi lặp lại câu vận động lưỡi. Hãy thử từ từ ban đầu, sau đó dần dần tăng tốc độ cho đến khi phát âm tự nhiên và lưu loát.

# in_sentence_short_record_advice
source: Record yourself repeating each sentence, focusing on the pronunciation of /{sound}/.
vi: Ghi âm lại khi lặp lại từng câu, tập trung vào cách phát âm âm /{sound}/.

# in_sentence_long_repeat_advice
source: Repeat this exercise several times a day. You can try creating your own tongue twisters, too!
vi: Lặp lại bài tập này mỗi ngày một số lần. Bạn cũng có thể thử tạo các câu vận động lưỡi của riêng bạn!

# in_sentence_short_repeat_advice
source: Repeat this exercise several times a day.
vi: Lặp lại bài tập này mỗi ngày một số lần.

# practice_example_subtitle
source: Pronunciation practice is even more effective in a meaningful context. Here are several sentences with /k/ that you may find yourself saying frequently.
vi: Luyện tập phát âm hiệu quả hơn trong ngữ cảnh ý nghĩa. Dưới đây là một số câu với âm /k/ mà bạn có thể thường xuyên sử dụng.

# in_sentence_listen_advice
source: Listen to how each sentence is pronounced. Which word(s) include /{sound}/?
vi: Nghe cách phát âm mỗi câu. Có từ nào chứa âm /{sound}/ không?
